{"img": "http://imgs.xkcd.com/comics/circuit_diagram.png", "title": "Circuit Diagram", "month": "4", "num": 730, "link": "", "year": "2010", "news": "", "safe_title": "Circuit Diagram", "transcript": "{{Title text: I just caught myself idly trying to work out what that resistor mass would actually be, and realized I had self-nerd-sniped.}}\n\n((A large and complicated circuit diagram.))\n\n[[In the upper left corner there is a map scale, labeled with 1 mi (1 km).\n\nUnderneath the scale is an antenna symbol that leads down to a blender, an Arduino; labeled with \"Arduino, just for blog cred\"; and a chip; \"Most expensive chip available\".\n\nTo the right of the antenna there is the symbol for an inductor that has it's lower terminal going into a the left terminal of pattern that looks like a highway cloverleaf.  The upper terminal leads to a line that is going to the upper terminal of that cloverleaf and to a battery symbol (with the + and - symbols on the wrong ends) with a value of &#8730;2V.  The right terminal of the cloverleaf is going into a resistor symbol label \"120&#937; or to taste\".  Connected to the other terminals of the resistor and battery is a switch that is labeled \"glue open\".  The bottom of the two lines has a transistor with two emitters, one P and one N, and no collector.  The P-type emitter is connected to the top line and a jar of scarab beetles.  Above the beetles is a resistor labeled \"brown blue orange\". To the right is an unlabeled resistor with a center tap going into a capacitor, with a ground on the other end.  Above the capacitor is a diode, and below an inductor.  To the right is another inductor.  The two inductors and ground are all covered by a \"solder blob\".  The rightmost component is a \"666 timer\" that has pin 5 going into a question mark.\n\nBack to the left side, below and to the left of the cloverleaf is a compass rose.  The bottom terminal of the cloverleaf is connected to a battery, labeled 50V, with grounds on both sides.  To the right of the battery is a long horizontal wire that is labeled \"pull this wire really tight.\"  That wire is hooked up to a vertical wire that connects to the N-type emitter of the transistor above it.  To the right is an AC source that is labeled 240V, shorted out, with a label on the short \"omit this if you're a wimp.\"  To the right of that is an inductor that is labeled with \"11kg\", a batman symbol, and a squirrel.\n\nBack to the left end of the diagram, where the blender is, there is a wire that is labeled as a distance 3\n8\" from the wire with the 50V battery.  To the right there is a frowny face, then a vertical wire with a 90 degree bend labeled \"caution &#8625;\".  That leads into a balloon.  Under the balloon is an inductor symbol with a line on the bottom edge labeled as \"warm front\".\n\nUnderneath the blender and to the right of the Arduino is a resistor labeled \"", "alt": "I just caught myself idly trying to work out what that resistor mass would actually be, and realized I had self-nerd-sniped.", "day": "21"}